---
kind: property
id: P:Autodesk.Revit.DB.CurveElementFilter.CurveElementType
source: html/101d9955-6042-a28e-2fab-89e4e71101d9.htm
---
# Autodesk.Revit.DB.CurveElementFilter.CurveElementType Property

The curve element type.

## Syntax (C#)
```csharp
public CurveElementType CurveElementType { get; }
```